Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/waste_management_and_recycling/waste_from_electric_and_electronic_equipment.html.txt.tmx
Source language: en
Languages: ga

source: Waste from electrical and electronic equipment
ga: Dramhaíl ó fhearais leictreacha agus leictreonacha

source: Many everyday consumer items contain electrical parts
ga: Bíonn compháirteanna leictreacha i neart gnáthearraí tomhaltais

source: Waste Electrical and Electronic Equipment (WEEE) is electrical and electronic equipment that is broken or unwanted
ga: Trealamh leictreach agus leictreonach atá briste nó atá gan iarraidh atá i nDramhthrealamh Leictreach agus Leictreonach (DTLL)

source: Any appliance that runs on electricity has the potential to cause damage to the environment if it is not disposed of in a responsible way
ga: D’fhéadfadh gléas ar bith a úsáideann leictreachas díobháil a dhéanamh don chomhshaol mura bhfaightear réidh leis ar bhealach freagrach

source: Common items of electrical and electronic waste are:
ga: Earraí coiteanna de dhramhthrealamh leictreach agus leictreonach iad:

source: • Large household appliances (refrigerators/freezers, washing machines, dishwashers)
ga: • Gléasanna móra teaghlaigh (cuisneoirí/reoiteoirí, meaisíní níocháin, meaisíní níocháin soithí)

source: • Small household appliances (toasters, coffee makers, irons, hairdryers)
ga: • Gléasanna beaga teaghlaigh (tóstaeir, gléasanna caife, iarainn le haghaidh éadaí, triomadóirí gruaige)

source: • Information technology (IT) and telecommunications equipment (personal computers, telephones, mobile phones, laptops, printers, scanners, photocopiers)
ga: • Trealamh teicneolaíocht faisnéise (TF) agus teileachumarsáide (ríomhairí pearsanta, gutháin, gutháin phóca, ríomhairí glúine, printéirí, scanóirí, innill fótachóipeála)

source: • Consumer equipment (televisions, stereo equipment, electric toothbrushes)
ga: • Trealamh tomhaltais (teilifíseáin, trealamh steiréó, scuaba fiacla leictreacha)

source: • Lighting equipment (fluorescent lamps)
ga: • Trealamh soilsithe (lampaí fluaraiseacha)

source: • Electrical and electronic tools (handheld drills, saws, screwdrivers)
ga: • Uirlisí leictreacha agus leictreonacha (druilirí láimhe, sábha, scriúirí)

source: • Toys, leisure and sports equipment
ga: • Bréagáin, trealamh fóillíochta agus spóirt

source: • Medical equipment systems (with the exception of all implanted and infected products)
ga: • Córais trealamh leighis (seachas gach táirge ionchlannaithe agus ionfhabhtaithe)

source: • Monitoring and control instruments
ga: • Gléasanna monatóireachta agus rialúcháin

source: The main environmental concerns are resource depletion and dangerous substances arising from waste from electrical and electronic equipment
ga: Is iad na príomhábhair bhuartha comhshaoil ídiú acmhainní agus substaintí baolacha ag eascairt ó dhramhthrealamh leictreach agus leictreonach

source: If electrical and electronic products are disposed of in landfill sites, millions of tonnes of materials that could be recovered and reused for new products are being lost
ga: Má dhéantar táirgí leictreacha agus leictreonacha a dhiúscairt i láithreán líonadh talún, tá na milliúin tonna d’ábhair a d’fhéadfaí a aisghabháil agus a athúsáid le haghaidh táirgí nua á gcailleadh

source: Recovery of these materials would reduce the need to extract more raw materials for the manufacture of new products
ga: Laghdódh aisghabháil na n-ábhar seo an gá chun níos mó amhábhar a eastóscadh chun táirgí nua a dhéantúsú

source: Some electronic equipment and/or its components contain substances that are considered dangerous to the environment and human health if they are disposed of carelessly
ga: Tá substaintí a mheastar atá baolach don chomhshaol agus do shláinte daoine i gcuid den trealamh leictreonach agus/nó i gcuid dá chomhpháirteanna, má chuirtear de láimh é gan chúram

source: Although these dangerous substances are usually only contained in small amounts, they have great potential for causing serious environmental damage
ga: Cé nach mbíonn sna substaintí dainséaracha seo ach i méideanna beaga, de ghnáth, d’fhéadfaidís díobháil thromchúiseach a dhéanamh don chomhshaol

source: Landfill is the disposal of waste material by burying it
ga: Is éard atá i líonadh talún ná dramhábhar a dhiúscairt trí é a chur sa talamh

source: Space at landfill sites is becoming scarce
ga: Tá an spás ag láithreáin líonadh talún ag éirí scáinte

source: It is not appropriate to dispose of waste from electric and electronic equipment in landfill sites because of the harmful substances that waste from electric and electronic equipment is known to contain
ga: Níl sé oiriúnach dramhaíl a dhiúscairt ó dhramhthrealamh leictreach agus leictreonach i láithreáin líonadh talún mar gheall ar na substaintí díobhálacha arb eol dúinn atá i ndramhaíl ó threalamh leictreach agus leictreonach

source: Incineration is the process of burning materials at high temperatures
ga: Is éard atá i loisceadh ná ábhair a dhó ar ardteochtaí

source: Recycling of waste from electric and electronic equipment
ga: Dramhaíl ó threalamh leictreach agus leictreonach a athchúrsáil

source: The recycling industry is complex
ga: Tá an tionscal athchúrsála casta

source: There are large shredder operators and smaller specialist recyclers
ga: Tá oibreoirí stiallaire móra agus athchúrsálaithe speisialtóra níos lú ann

source: They are backed up by other companies, which provide services such as plastics recycling and refining precious metals
ga: Tacaíonn cuideachtaí eile leo, a sholáthraíonn seirbhísí, ar nós athchúrsáil plaisteach agus miotal lómhar a mhínchóireáil

source: In addition, there may be small repair and refurbishment initiatives
ga: Anuas air sin, d’fhéadfadh tionscnaimh a bheith ann le haghaidh deisiú beag agus athchóiriú

source: Recycling companies also collect items for export to countries with more advanced recycling systems and those that extract components and materials for recycling
ga: Chomh maith leis sin, bailíonn cuideachtaí athchúrsála earraí chun iad a easpórtáil go dtí tíortha ina bhfuil córais athchúrsála atá níos nua-aimseartha agus córais ina mbaintear na comhábhair agus na hábhair siúd le haghaidh athchúrsála

source: Shredders process a mixed range of equipment to recover different materials, primarily metals
ga: Déanann stiallairí réimse measctha de threalamh a phróiseáil chun ábhair éagsúla, miotal go príomha, a aisghabháil

source: Large hammermills, also known as fragmentisers, shred a mixed stream of metal-rich materials, including end-of-life vehicles, household appliances and other light iron
ga: Déanann muilinn chasúir mhóra, ar a dtugtar innill scoilte chomh maith, sreabhadh measctha d’ábhair ina bhfuil neart miotail, feithiclí a bhfuil a ré caite, fearais tí agus iarann éadroim eile ina measc

source: The WEEE Directive requires producers to be responsible for the financing of the collection, treatment, recovery and environmentally sound disposal of WEEE
ga: Ceanglaíonn an Treoir maidir le DTLL ar tháirgeoirí a bheith freagrach as maoiniú a dhéanamh ar DTLL a bhailiú, plé leis, é a aisghabháil agus é a dhiúscairt ar bhealach nach ndéanann díobháil don chomhshaol

source: It means that final users of such household WEEE are entitled to leave that waste back free of charge, either to retail outlets when buying a replacement item, or to other authorised collection points, including local authority civic amenity sites
ga: Ciallaíonn sé go mbíonn úsáideoirí deiridh an DTLL tí sin i dteideal an dramhaíl sin a fhágáil ar ais saor in aisce, cibé acu chuig asraonta miondíola nuair a bhíonn earra ionaid á cheannach, nó chuig pointí údaraithe eile bailithe, láithreáin chonláiste chathartha de chuid údaráis áitiúla

source: WEEE includes batteries (pdf) and accumulators
ga: Áirítear leis DTLL cadhnraí (pdf) agus taisc-chadhnraí

source: The first WEEE Directive (Directive 2002/96/EC) entered into force in February 2003
ga: Tháinig an chéad Treoir maidir le DTLL (Treoir 2002/96/CE) i bhfeidhm i bhFeabhra 2003

source: The Directive provided for the creation of collection schemes where consumers return their WEEE free of charge
ga: Rinne an Treoir foráil do scéimeanna bailithe a chruthú ina dtugann tomhaltóirí a DTLL ar ais saor in aisce

source: In December 2008, the European Commission proposed to revise the Directive in order to tackle the fast increasing waste stream
ga: I Nollaig 2008, bheartaigh an Coimisiún Eorpach chun an Treoir a leasú chun dul i ngleic le sreabhadh dramhaíola a raibh méadú mear ag teacht air

source: The new WEEE Directive 2012/19/EU entered into force on 13 August 2012 and became effective on 14 February 2014
ga: Tháinig an Treoir DTLL 2012/19/AE nua i bhfeidhm an 13 Lúnasa 2012 agus bhain sí éifeacht amach an 14 Feabhra 2014

source: Local government management of waste from electric and electronic equipment
ga: Bainistíocht an údaráis áitiúil ar dhramhaíl ó threalamh leictreach agus leictreonach

source: Local authorities have developed initiatives for improving their management of waste from electric and electronic equipment as part of their general waste management plans
ga: Tá tionscnaimh forbartha ag údaráis áitiúla chun feabhas a chur ar an mbainistíocht a dhéanann siad ar dhramhaíl ó threalamh leictreach agus leictreonach mar chuid dá bpleananna ginearálta bainistíochta dramhaíola

source: These plans revolve around improved collection facilities at civic amenity sites, increasing the amount of waste from electric and electronic equipment that is recycled and cutting down on the amount of waste from electric and electronic equipment sent to landfill sites
ga: Baineann na pleananna seo le háiseanna feabhsaithe bailithe ag láithreáin chonláiste chathartha, an méid dramhaíola ó threalamh leictreach agus leictreonach a mhéadú a dhéantar a athchúrsáil agus an méid dramhaíola a laghdú a chruthaíonn trealamh leictreach agus leictreonach a chuirtear ar aghaidh chuig láithreáin líonadh talún

source: For details of initiatives in your own area, you should contact your local authority
ga: Chun teacht ar shonraí faoi thionscnaimh i do cheantar féin, ba cheart duit teagmháil a dhéanamh le d’údarás áitiúil

source: As noted above, the WEEE Directive provides for free take-back of end-of-life equipment
ga: Faoi mar a luaitear thuas, foráiltear sa Treoir maidir le DTLL go dtógtar trealamh a bhfuil a ré caite ar ais saor in aisce

source: Householders may also deposit WEEE free at civic amenity facilities
ga: Sa mhullach air sin, féadfaidh sealbhóirí tí DTLL a fhágáil ag áiseanna conláiste chathartha

source: For details of how to dispose of electrical and electronic waste in the proper way, contact your local authority
ga: Chun teacht ar shonraí ar conas dramhaíl leictreach agus leictreonach a dhiúscairt ar an mbealach ceart, déan teagmháil le d’údarás áitiúil

source: It will be able to advise you on how to deal with this kind of waste
ga: Beidh siad in ann comhairle a chur ort ar conas déileáil leis an gcineál seo dramhaíola
